<details><summary>Show Plan</summary>

```

terraform
module.tenant_database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=FC30PA]
module.tenant_database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
data.github_release.latest_release: Reading...
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.monitoring.grafana_data_source.cloudwatch: Refreshing state... [id=70]
data.github_release.latest_release: Read complete after 0s [id=96004835]
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
data.aws_ecr_repository.aws_otel_collector: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
module.ecs.data.aws_iam_policy_document.otel: Reading...
module.tenant_database_cluster.data.aws_partition.current: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-push_geoip_bucket_access]
module.analytics.aws_kms_key.analytics_bucket: Refreshing state... [id=1b7b17ad-84bc-412f-81b6-97f0ba68885c]
module.ecs.data.aws_iam_policy_document.otel: Read complete after 0s [id=1623705645]
module.tenant_database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/511c1c1e-eace-4166-b7c1-9bbfc82c70f6]
module.analytics.aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.push.staging.analytics.data-lake]
module.database_cluster.data.aws_partition.current: Reading...
module.database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
data.aws_ecr_repository.repository: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.aws_iam_policy.otel: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-push-otel]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
module.analytics.aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/push/staging]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221206230157544800000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging-push-ecs-task-execution-role-20230317135327686100000001]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
data.aws_ecr_repository.aws_otel_collector: Read complete after 1s [id=aws-otel-collector]
module.ecs.aws_iam_role_policy_attachment.ssm_read_only_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221206230156280200000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
module.monitoring.grafana_data_source.prometheus: Refreshing state... [id=71]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z04987691W18X63LDNXVM]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z04987691W18X63LDNXVM__9407f2eddc416d7cd8c8ee599f0a5c6a.staging.echo.walletconnect.com._CNAME]
data.aws_ecr_repository.repository: Read complete after 1s [id=echo-server]
module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.push.staging.analytics.data-lake,private]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-push_analytics-data-lake_bucket_access]
module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.push.staging.analytics.data-lake]
module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.push.staging.analytics.data-lake]
module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.push.staging.analytics.data-lake]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach: Refreshing state... [id=staging-push-ecs-task-execution-role-20230317135338509100000002]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.tenant_database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0ce11b7546d3b6906]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.tenant_database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-3979038549]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.tenant_database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-tenant-database]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z04987691W18X63LDNXVM_staging.echo.walletconnect.com_A]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.monitoring.grafana_dashboard.at_a_glance: Refreshing state... [id=0:staging-push]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.tenant_database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-tenant-database]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.tenant_database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-tenant-database-1]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.database_cluster.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ engine_version_actual               = "13.6" -> "13.8"
        id                                  = "staging-push-database"
        tags                                = {}
        # (39 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ engine_version_actual               = "13.6" -> "13.8"
        id                                  = "staging-push-tenant-database"
        tags                                = {}
        # (39 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.database_cluster.aws_iam_role.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.database_cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # module.database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
      ~ engine_version                      = "13.8" -> "13.6"
        id                                  = "staging-push-database"
        tags                                = {}
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.database_cluster.aws_rds_cluster_instance.this["1"] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "this" {
      ~ engine_version                        = "13.8" -> "13.6"
        id                                    = "staging-push-database-1"
      ~ monitoring_interval                   = 0 -> 30
      + monitoring_role_arn                   = (known after apply)
        tags                                  = {}
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_appautoscaling_policy.cpu_scaling will be created
  + resource "aws_appautoscaling_policy" "cpu_scaling" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging-push-application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging-push/staging-push-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 180
          + scale_out_cooldown = 180
          + target_value       = 30

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.memory_scaling will be created
  + resource "aws_appautoscaling_policy" "memory_scaling" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging-push-application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging-push/staging-push-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 180
          + scale_out_cooldown = 180
          + target_value       = 30

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/staging-push/staging-push-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.tenant_database_cluster.aws_iam_role.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.tenant_database_cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
      ~ engine_version                      = "13.8" -> "13.6"
        id                                  = "staging-push-tenant-database"
        tags                                = {}
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tenant_database_cluster.aws_rds_cluster_instance.this["1"] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "this" {
      ~ engine_version                        = "13.8" -> "13.6"
        id                                    = "staging-push-tenant-database-1"
      ~ monitoring_interval                   = 0 -> 30
      + monitoring_role_arn                   = (known after apply)
        tags                                  = {}
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*